print('Hello, world!')
# 파이썬 코드를 저장한 .py 파일 = 파이썬 스크립트, 스크립트 파일
# - 코드실행: python 스크립트파일.py  F5(VSCODE)
# - 코드종료: exit() Ctrl+z
#
# - 한줄에 여러 문장 사용한다면-> 세미콜론(;)을 붙여라 
# 파이썬에서 한글 주석 사용하기 
# - 파이썬 3에서는 .py스크립트 파일의 기본 인코딩이 UTF-8 임. 
# - 스크립트 파일을 다른 인코딩(CP949, EUC-KR)로 저장하면 실행 할때 에러발생.
# 인코딩: 문자를 컴퓨터가 이해할 수 있는 0, 1로 바꾸는 것. UTF-8은 전세계 언어를 표현(CP949, EUC-KR은 한국어만 표현가능)
#
# 들여쓰기: 스페이스2칸/4칸/tab 
#
# 컴퓨테이셔널 씽킹과 알고리즘차이 
# 컴퓨테이셔널 씽킹 4가지: 
#   1) 분해 : 복잡한 문제 작은 문제로 나눔. 
#   2) 패턴인식: 문제안에서 유사성 발견. 
#   3) 추상화: 문제의 핵심에만 집중하고 부차적인 것은 제외. 
#   4) 알고리즘: 이렇게 정의한 문제를 해결하는 절차 